dominiczy/satelliteplatform/processors/msp430/msp430 (dominic zijlstra's conflicted copy 2015-03-27).H
/******************************************************
 * Architecture Module header file.                   *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  _MSP430_H
#define  _MSP430_H

#include "systemc.h"
#include "ac_module.H"
#include "ac_utils.H"
#include "msp430_parms.H"
#include "msp430_arch.H"
#include "msp430_isa.H"
#include "ac_tlm_intr_port.H"
#include "msp430_intr_handlers.H"
#include "ac_gdb_interface.H"
#include "ac_gdb.H"


class msp430: public ac_module, public msp430_arch, public AC_GDB_Interface<msp430_parms::ac_word> {
private:
  typedef cache_item<msp430_parms::AC_DEC_FIELD_NUMBER> cache_item_t;
  typedef ac_instr<msp430_parms::AC_DEC_FIELD_NUMBER> ac_instr_t;
public:

  unsigned bhv_pc;
 

  bool has_delayed_load;
  char* delayed_load_program;

  msp430_parms::msp430_isa ISA;
  msp430_inta_handler inta_hnd;
  ac_tlm_intr_port inta;

  cache_item_t* DEC_CACHE;

  unsigned id;

  bool start_up;
  unsigned* instr_dec;
  ac_instr_t* instr_vec;

  AC_GDB<msp430_parms::ac_word>* gdbstub;

  //!Behavior execution method.
  void behavior();

 
  SC_HAS_PROCESS( msp430 );

  //!Constructor.
  msp430( sc_module_name name_ ): ac_module(name_), msp430_arch(), ISA(*this), inta_hnd(*this), inta("inta", inta_hnd) {

    SC_THREAD( behavior );
    bhv_pc = 0; 
    has_delayed_load = false; 
    start_up=1;
    id = 1;

    gdbstub = new AC_GDB<msp430_parms::ac_word>(this, msp430_parms::GDB_PORT_NUM);

  }
  void init_dec_cache() {
    DEC_CACHE = (cache_item_t*) calloc(sizeof(cache_item_t),dec_cache_size);
  }
  /***********
   * GDB Support - user supplied methods
   * For further information, look at ~/src/aclib/ac_gdb/ac_gdb_interface.H
   ***********/

  /* Processor Feature Support */
  bool get_ac_tgt_endian();

  void ac_stop();

  /* Register access */
  int nRegs(void);
  msp430_parms::ac_word reg_read(int reg);
  void reg_write( int reg, msp430_parms::ac_word value );
  /* Memory access */
  unsigned char mem_read( unsigned int address );
  void mem_write( unsigned int address, unsigned char byte );
  /* GDB stub access */
  AC_GDB<msp430_parms::ac_word>* get_gdbstub();

  unsigned get_ac_pc();

  void set_ac_pc( unsigned int value );

  virtual void PrintStat();

  void init(int ac, char* av[]);

  void init();

  void load(char* program);

  void delayed_load(char* program);

  void stop(int status = 0);

  void enable_gdb(int port = 5000);

  virtual ~msp430() {};

};
#endif  //_MSP430_H

